tap "codecrafters-io/tap"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "oven-sh/bun"
brew "bat"
brew "bat-extras"
brew "btop"
brew "eza"
brew "fabric"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "git-filter-repo"
brew "glow"
brew "imagemagick"
brew "jj"
brew "jqp"
brew "lazydocker"
brew "lazygit"
brew "luarocks"
brew "mise"
brew "mprocs"
brew "nmap"
brew "nushell"
brew "pipx"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tectonic"
brew "terraform"
brew "tmux"
brew "uv"
brew "xh"
brew "yq"
brew "zola"
brew "zoxide"
brew "codecrafters-io/tap/codecrafters"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "font-fira-code-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "karabiner-elements"
cask "neovide-app"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "rust-lang.rust-analyzer"
vscode "vscodevim.vim"
