tap "codecrafters-io/tap"
tap "nikitabobko/tap"
tap "supabase/tap"
tap "withgraphite/tap"
brew "bat"
brew "bat-extras"
brew "beads"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "git-filter-repo"
brew "jq"
brew "jqp"
brew "just"
brew "lazygit"
brew "luarocks"
brew "mise"
brew "mprocs"
brew "neovim"
brew "nmap"
brew "node@22"
brew "nushell"
brew "uv"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "tectonic"
brew "tmux"
brew "xh"
brew "yq"
brew "codecrafters-io/tap/codecrafters"
brew "supabase/tap/supabase"
brew "withgraphite/tap/graphite"
cask "nikitabobko/tap/aerospace"
cask "font-fira-code-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "ghostty"
